c5/src/Documents/ClosingEmployees/ClosingEmployees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ClosingEmployees</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DebtAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Debts</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CloseDebt</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/ClosingEmployees/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	DocumentPresentation.StandardFields ( Fields, StandardProcessing );
	
EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	DocumentPresentation.StandardPresentation ( Metadata.Documents.ClosingEmployees.Synonym, Data, Presentation, StandardProcessing );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	commitRecords ( Env );
	flagRegisters ( Env );
	return true;
	
EndFunction
 
Procedure getData ( Env )
	
	sqlFields ( Env );
	sqlDebts ( Env );
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Documents.Date as Date, Documents.Company as Company, Documents.DebtAccount as DebtAccount
	|from Document.ClosingEmployees as Documents
	|where Documents.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlDebts ( Env )
	
	s = "
	|// #Debts
	|select Debts.Amount as Amount, Debts.CloseDebt as CloseDebt, Debts.Employee as Employee, Debts.Account as Account
	|from Document.ClosingEmployees.Debts as Debts
	|where Debts.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure commitRecords ( Env )
	
	fields = Env.Fields;
	debtAccount = fields.DebtAccount;
	closeDebts = OutputCont.CloseEmployeeDebts ();
	formationDebts = OutputCont.FormationEmployeeDebts ();
	p = GeneralRecords.GetParams ();
	p.Date = fields.Date;
	p.Company = fields.Company;
	p.Recordset = Env.Registers.General;
	for each row in Env.Debts do
		if ( row.CloseDebt ) then
			employeeType = "Cr";
			debtType = "Dr";
			p.Content = closeDebts;
		else
			employeeType = "Dr";
			debtType = "Cr";
			p.Content = formationDebts;
		endif;
		p [ "Account" + employeeType ] = row.Account;
		p [ "Account" + debtType ] = debtAccount;
		employee = row.Employee;
		p.DimDr1 = employee;
		p.DimCr1 = employee;
		p.Amount = row.Amount;
		GeneralRecords.Add ( p );
	enddo; 

EndProcedure

Procedure flagRegisters ( Env )
	
	Env.Registers.General.Write = true;
	
EndProcedure

#endregion

#endif
